app/controllers/article_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "articles" ("user_id", "title", "content", "date", "likesNo", "commentNo", "article_imageURL", "created_at", "updated_at", "author", "category") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "article_categories" ("article_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 3], ["category_id", 1], ["created_at", "2023-02-07 18:38:41.751134"], ["updated_at", "2023-02-07 18:38:41.751134"]]
---
    def create
        u = User.find(params[:user_id])
        a = u.articles.create(
            title: params[:title],
            content: params[:content],
            date: params[:date],
            likesNo: params[:likesNo],
            commentNo: params[:commentNo],
            article_imageURL: params[:article_imageURL]
        )

        @categoryArray = params[:categories]
        @categoryArray.each{
            |categoryEle|
            ArticleCategory.create(article_id: a.id, category_id: categoryEle)

SELECT "articles".* FROM "articles"
---
    def readAll
        @articles = Article.all

SELECT "articles".* FROM "articles" WHERE (title LIKE '%ee%')
---
    def readByTitle
        a = Article.where("title LIKE ?", "%#{params[:title]}%")

SELECT "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 6]]
---
    def readPage
        pages = (params[:pageNo]).to_i
        pages = pages - 1;
        lim = 2
        a = 0
        for i in 1..pages
            a += lim
        end
        a = Article.offset(a).limit(lim)

SELECT "articles".* FROM "articles" WHERE "articles"."date" BETWEEN ? AND ?  [["date", "2009-01-01"], ["date", "2011-12-31"]]
---
    def readByRange
        a = Article.where(date: (params[:start]..params[:end]))

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "content" = ?, "date" = ?, "updated_at" = ? WHERE "articles"."id" = ?
---
    def update
        a = Article.find(params[:id])
        a.title = params[:title] || a.title
        a.content = params[:content] || a.content
        a.date = params[:date] || a.date
        a.article_imageURL = params[:article_imageURL] || a.article_imageURL
        a.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "article_categories".* FROM "article_categories" WHERE "article_categories"."article_id" = ?  [["article_id", 6]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
DELETE FROM "article_categories" WHERE "article_categories"."id" = ?  [["id", 7]]
DELETE FROM "article_categories" WHERE "article_categories"."id" = ?  [["id", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 6]]
---
    def delete
        a = Article.find(params[:id])
        ArticleCategory.where(article_id: a.id).each{
            |a|
            a.delete
        }
        a.delete

DELETE FROM "articles"
DELETE FROM "article_categories"
---
    def deleteAll
        ArticleCategory.delete_all
        a = Article.delete_all