app/controllers/article_category_controller.rb

    def readAll
        a = ArticleCategory.all
---
SELECT "article_categories".* FROM "article_categories"