app/controllers/category_controller.rb

    def create
        c = Category.create(name: params[:name])
---
INSERT INTO "categories" ("article_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", nil], ["name", "Philosophy"], ["created_at", "2023-02-07 13:35:19.865499"], ["updated_at", "2023-02-07 13:35:19.865499"]]

    def readAllCategory
        c = Category.all
---
SELECT "categories".* FROM "categories"

    def findByCategory
        @art = []
        ArticleCategory.where(category_id: params[:category_id]).each {
            |a|
            @art.push(Article.where(id: a.article_id)[0])
---
SELECT "article_categories".* FROM "article_categories" WHERE "article_categories"."category_id" = ?  [["category_id", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."article_id" = ?  [["article_id", 6]]