app/controllers/user_controller.rb

INSERT INTO "users" ("name", "username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "user"], ["username", "user1"], ["email", "user1@gmail.com"], ["password", "[FILTERED]"], ["created_at", "2023-02-07 13:18:24.029872"], ["updated_at", "2023-02-07 13:18:24.029872"]]
---
    def create
        u = User.create(
            name: params[:name],
            username: params[:username],
            email: params[:email],
            password_digest: params[:password]
        )

SELECT "users".* FROM "users"
---
    def readAllUser
        u = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
    def readUser
        u = User.where(id: params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 4]]
DELETE FROM "article_categories" WHERE "article_categories"."article_id" = ?  [["article_id", 16]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 13]]
SELECT "article_categories".* FROM "article_categories" WHERE "article_categories"."article_id" = ?  [["article_id", 13]]
DELETE FROM "article_categories" WHERE "article_categories"."id" = ?  [["id", 25]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 18]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 9]]
---
    def delete
        u = User.find(params[:id])
        Article.where(user_id: u.id).each{
            |art|
            ArticleCategory.where(article_id: art.id).delete_all
            art.delete
        }
        u.delete